Revit 2027 API
DividedSurface.HostReference Property
A reference to the divided face on the host.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Reference HostReference { get; }
Public ReadOnly Property HostReference As Reference
	Get
public:
property Reference^ HostReference {
	Reference^ get ();
}
member HostReference : Reference with get
Property Value
Reference
Remarks
This is the same as the hostReference argument to the NewDividedSurface method of FamilyItemFactory.
See Also
Reference
DividedSurface Class
Autodesk.Revit.DB Namespace